app/views/messages/_message.html.erb

SELECT "messages".* FROM "messages"  WHERE "messages"."group_id" = ?  ORDER BY created_at DESC  [["group_id", 7]]
---
	<span class="content">
	<%= @group.messages.each do |m| %>