app/views/groups/edit.html.erb

SELECT  "group_subscriptions".* FROM "group_subscriptions"  WHERE "group_subscriptions"."groupID" = ? AND "group_subscriptions"."id" = ? LIMIT 1  [["groupID", 5], ["id", 5]]
---
	<br>
		<% @groups.group_subscriptions.each do |g| %>

SELECT  "users".* FROM "users"  WHERE "users"."id" = 5  ORDER BY "users"."id" ASC LIMIT 1
---
			<%= g.userID%>
			<!--% if @users.find(1).id == g.userID %>