app/views/groups/index.html.erb

			<ul>
				<% g.group_subscriptions.each do |subscription| %>
---
SELECT  "group_subscriptions".* FROM "group_subscriptions"  WHERE "group_subscriptions"."group_id" = ?  ORDER BY "group_subscriptions"."id" ASC LIMIT 1  [[nil, 1]]
SELECT "groups".* FROM "groups"