app/views/groups/show.html.erb

<div id="messages">
	<% if @group.messages.any? %>
---
SELECT  1 AS one FROM "messages"  WHERE "messages"."group_id" = ? LIMIT 1  [["group_id", 5]]
SELECT "messages".* FROM "messages"  WHERE "messages"."group_id" = ?  ORDER BY created_at DESC  [["group_id", 7]]