app/controllers/groups_controller.rb

	def create

		@group = Group.new
		@group.name = params[:group][:name]
		@group.save
---
INSERT INTO "groups" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-10-26 06:12:39.493402"], ["name", "hoge"], ["updated_at", "2014-10-26 06:12:39.493402"]]

	def destroy
		Group.find(params[:id]).destroy
---
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 4]]
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 4]]

	def update
		@group = Group.find(params[:id])
		@group.update(name: params[:group][:name])
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "groups" SET "name" = ?, "updated_at" = ? WHERE "groups"."id" = 7  [["name", "もんげー"], ["updated_at", "2014-11-02 17:44:17.006383"]]

	def index
		user = User.first
		group_ids = GroupSubscription.where(userID: current_user.id).select(:groupID)
		@groups=Group.where(id: group_ids)
---
SELECT  "users".* FROM "users"   ORDER BY "users"."id" ASC LIMIT 1
SELECT "groups".* FROM "groups"  WHERE "groups"."id" IN ('all', '---

	def new
		#@group = Group.new
		@users = User.all
---
SELECT "users".* FROM "users"

	def show
=begin
		if current_user.blank?
			return render plain: 'Bad person', status: :bad_request
		end
=end
		@group = Group.find(params[:id])
		if !@group.group_subscriptions.where(userID: current_user.id).exists?
			return render plain: 'Bad person', status: :bad_request
		end
		@group.group_subscriptions.each do |g|
			@gmaster = @group.group_masters
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "group_subscriptions"  WHERE "group_subscriptions"."groupID" = ? AND "group_subscriptions"."userID" = 4 LIMIT 1  [["groupID", 5]]
SELECT "group_subscriptions".* FROM "group_subscriptions"  WHERE "group_subscriptions"."groupID" = ?  [["groupID", 2]]
SELECT  "group_masters".* FROM "group_masters"  WHERE "group_masters"."groupID" = ? AND "group_masters"."id" = ? LIMIT 1  [["groupID", 2], ["id", 2]]