app/controllers/groups_controller.rb

	def create

		@group = Group.new
		@group.name = params[:group][:name]
		@group.save

		@group_subscription = GroupSubscription.new
		@group_subscription.groupID = @group.id
		@group_subscription.userID = current_user.id
		@group_subscription.save

		for id in params[:group_users] do
			p id
			@group_subscription = GroupSubscription.new
			@group_subscription.groupID = @group.id
			@group_subscription.userID = id.to_i
			@group_subscription.save
		end

		@group_master = GroupMaster.new
		@group_master.groupID = @group.id
		@group_master.userID = current_user.id
		@group_master.save
---
INSERT INTO "group_subscriptions" ("created_at", "groupID", "updated_at", "userID") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-26 06:21:16.350451"], ["groupID", 3], ["updated_at", "2014-10-26 06:21:16.350451"], ["userID", 1]]
INSERT INTO "group_masters" ("created_at", "groupID", "updated_at", "userID") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-26 06:21:16.359577"], ["groupID", 3], ["updated_at", "2014-10-26 06:21:16.359577"], ["userID", 2]]

	def index
		@groups = Group.all
---
SELECT  "groups".* FROM "groups"   ORDER BY "groups"."id" ASC LIMIT 1