app/controllers/messages_controller.rb

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 5]]
SELECT "group_subscriptions".* FROM "group_subscriptions"  WHERE "group_subscriptions"."groupID" = ?  [["groupID", 5]]
INSERT INTO "messages" ("content", "created_at", "group_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "もんげ"], ["created_at", "2014-11-04 07:27:36.838470"], ["group_id", 7], ["updated_at", "2014-11-04 07:27:36.838470"], ["user_id", 4]]
---
  def create
=begin
		p "メッセージ作成"
		@group = Group.find(params[:group_id])
		p @group.name
		@group.group_subscriptions.each do |g|
			if g.user.id == current_user.id
				p current_user.username
			else
				p g.user.username
			end
		end
=end
		params[:user_id] = current_user.id
    @message = Message.new
		@message.group_id = params[:group_id]
		@message.user_id = params[:user_id]
		@message.content = params[:message][:content]
		p @message

		@message.save